Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_to_families_and_children/paternity_benefit.html.txt.tmx
Source language: en
Languages: ga

source: Paternity Benefit is a payment for employed and self-employed people who are on paternity leave from work and covered by social insurance (PRSI)
ga: Íocaíocht is ea Sochar Atharthachta do dhaoine fostaithe agus féinfhostaithe atá ar saoire atharthachta ón obair agus atá cumhdaithe ag árachas sóisialach (ÁSPC)

source: It is paid for 2 weeks and is available for any child born or adopted on or after 1 September 2016
ga: Íoctar an sochar ar feadh coicíse agus tá fáil air d’aon leanbh a shaolaítear nó a uchtaítear an 2 Meán Fómhair 2016 nó ina dhiaidh sin

source: You can start paternity leave at any time within the first 6 months following the birth or adoption placement
ga: Féadfaidh tú tús a chur le saoire atharthachta ag tráth ar bith laistigh de na chéad 6 mhí i ndiaidh na breithe nó an tsocrucháin uchtála

source: You should apply for the payment 4 weeks before you intend to go on paternity leave (12 weeks if you are self-employed)
ga: Ba cheart duit iarratas a dhéanamh ar an íocaíocht 4 seachtaine sula mbeartaíonn tú dul ar saoire atharthachta (12 sheachtain má tá tú féinfhostaithe)

source: If you are already on certain social welfare payments then you may get half-rate Paternity Benefit
ga: Má tá íocaíochtaí áirithe leasa shóisialaigh á bhfáil agat cheana féin, b’fhéidir go dtabharfar Sochar Atharthachta ar leathráta duit

source: You can read detailed Frequently Asked Questions about Paternity Benefit on the Department of Social Protection's website
ga: Féadfaidh tú Ceisteanna Coitianta mionsonraithe a léamh faoi Shochar Atharthachta ar láithreán gréasáin na Roinne Coimirce Sóisialaí

source: You have the right to appeal the decision made on your Paternity Benefit claim
ga: Tá an ceart agat chun an cinneadh a achomharc a rinneadh faoi d’éileamh ar Shochar Atharthachta

source: You can get detailed information about making an appeal from the Social Welfare Appeals Office
ga: Féadfaidh tú faisnéis mhionsonraithe a fháil faoi achomharc a dhéanamh ón Oifig Achomhairc Leasa Shóisialaigh

source: You must notify your employer that you intend to take paternity leave and of your intended dates no later than 4 weeks before your leave
ga: Caithfidh tú fógra a thabhairt do d’fhostóir go mbeartaíonn tú chun saoire atharthachta a ghlacadh agus chun do dhátaí beartaithe a sholáthar tráth nach déanaí ná 4 seachtaine roimh do shaoire

source: You must provide proof of the expected date of birth of your child
ga: Caithfidh tú cruthúnas a thabhairt i leith an dáta a bhfuil súil leis go saolófar do leanbh

source: Generally you will need to provide a certificate from your spouse or partner's doctor confirming when your baby is due, or, confirmation of the actual date of birth if you are applying for leave after the birth
ga: Go ginearálta, beidh ort deimhniú a sholáthar ó dhochtúir do chéile nó do pháirtnéara shibhialta ina ndeimhnítear cathain a bhfuil súil leis go saolófar do leanbh, nó, deimhniú maidir leis an dáta féin breithe má tá iarratas á dhéanamh agat i ndiaidh na breithe

source: You should apply for Paternity Benefit at least 4 weeks before the date you intend to start your paternity leave
ga: Ba cheart duit iarratas a dhéanamh ar Shochar Atharthachta ar a laghad 4 seachtaine sula mbíonn sé beartaithe agat dul ar saoire atharthachta

source: If you are self-employed you should apply 12 weeks before
ga: Má tá tú féinfhostaithe, ba cheart duit iarratas a dhéanamh 12 sheachtain roimh ré

source: You must register for a Public Services Card (if you don't already have one) and register with the mywelfare.ie service (see 'How to apply' below for details of how to do this)
ga: Caithfidh tú clárú le haghaidh Cárta Seirbhíse Poiblí (mura bhfuil ceann agat cheana féin) agus clárú le seirbhís mywelfare.ie (féach 'Conas iarratas a dhéanamh' thíos chun teacht ar shonraí faoi conas seo a dhéanamh)

source: You must also satisfy the PRSI contribution conditions
ga: Chomh maith leis sin, caithfidh tú coinníollacha na ranníocaíochta ÁSPC a shásamh

source: Paternity Benefit is paid by the Department of Social Protection to people who have a certain number of paid PRSI contributions on their social insurance record
ga: Íocann an Roinn Coimirce Sóisialaí Sochar Atharthachta le daoine a bhfuil líon áirithe de ranníocaíochtaí íoctha ÁSPC acu ar a dtaifead árachais shóisialaigh

source: The PRSI contributions can be from both employment and self-employment
ga: Féadfaidh na ranníocaíochtaí ÁSPC a bheith ó fhostaíocht agus ó fhéinfhostaíocht araon

source: The PRSI classes that count for Paternity Benefit are A, E, H and S (self-employed)
ga: Is iad na haicmí ÁSPC a chuirtear san áireamh i dtreo Sochar Atharthachta A, E, H agus S (féinfhostaithe)

source: Members of the Defence Forces who pay PRSI at Class H are insured for Paternity Benefit but it is not payable while they are in service
ga: Níl Sochar Atharthachta iníoctha le comhaltaí atá ag fónamh sna Fórsaí Cosanta a íocann ÁSPC ar Aicme H, áfach

source: If you are an employee you must have:
ga: Más fostaí thú, caithfidh go bhfuil:

source: • At least 39 weeks PRSI paid in the 12-month period before the first day of your paternity leave
ga: • 39 seachtain de ÁSPC, ar a laghad, íoctha agat i rith na tréimhse 12 mhí roimh an gcéad lá de do shaoire atharthachta

source: • At least 39 weeks PRSI paid since first starting work and at least 39 weeks PRSI paid or credited in the relevant tax year or in the tax year immediately following the relevant tax year
ga: • 39 seachtain de ÁSPC, ar a laghad, íoctha agat ó thosaigh tú ag oibriú i dtosach agus 39 seachtain de ÁSPC, ar a laghad, íoctha agat nó curtha do shochar agat sa bhliain ábhartha chánach nó sa bhliain chánach díreach i ndiaidh na bliana ábhartha cánach

source: For example, if you are going on paternity leave in 2017, the relevant tax year is 2015 and the year following that is 2016
ga: Mar shampla, má bheidh tú ag dul ar saoire atharthachta in 2017, is é 2015 an bhliain ábhartha chánach agus is í an bhliain ina dhiaidh sin 2016

source: • At least 26 weeks PRSI paid in the relevant tax year and at least 26 weeks PRSI paid in the tax year immediately before the relevant tax year
ga: • 26 seachtain de ÁSPC, ar a laghad, íoctha agat sa bhliain ábhartha chánach agus 26 seachtain de ÁSPC, ar a laghad, íoctha agat sa bhliain chánach díreach roimh an mbliain ábhartha chánach

source: For example, if you are going on paternity leave in 2017, the relevant tax year is 2015 and the year before that is 2014
ga: Mar shampla, má bheidh tú ag dul ar saoire atharthachta in 2017, is é 2015 an bhliain ábhartha chánach agus is í an bhliain roimhe sin 2014

source: If you do not meet these PRSI conditions and you were self-employed before starting work as an employee, you can use your Class S contributions to qualify for Paternity Benefit - see PRSI conditions for self-employed people below
ga: Mura gcomhlíonann tú na coinníollacha ÁSPC seo agus má bhí tú féinfhostaithe sular thosaigh tú ag oibriú mar fhostaí, féadfaidh tú do ranníocaíochtaí Aicme S a úsáid chun cáiliú do Shochar Atharthachta – féach coinníollacha ÁSPC do dhaoine féinfhostaithe thíos

source: You are awarded credited contributions or credits automatically when you are getting Paternity Benefit
ga: Bronntar ranníocaíochtaí nó creidmheasanna creidiúnaithe ort go huathoibríoch nuair a bhíonn Sochar Atharthachta á fháil agat

source: Credits are awarded at the same rate as your last paid contribution
ga: Bronntar creidmheasanna ar an ráta céanna leis an ranníocaíocht deiridh a d’íoc tú

source: These credits help protect your future entitlement to social welfare benefits and pensions
ga: Cabhraíonn na creidmheasanna seo chun do theidlíocht amach anseo do shochair agus pinsin leasa shóisialaigh a chosaint

source: If you were previously insurably employed in a country covered by EU Regulations, you may combine your insurance record in that country with your Irish PRSI contributions to help you qualify for Paternity Benefit in Ireland
ga: Má bhí fostaíocht inárachais agat roimhe seo i dtír atá cumhdaithe ag Rialacháin an AE, féadfaidh tú do thaifead árachais sa tír sin a chur le do ranníocaíochtaí Éireannacha ÁSPC chun cabhrú leat cáiliú do Shochar Atharthachta in Éirinn

source: You must be currently in insurable employment in Ireland and have paid your most recent PRSI contribution in Ireland
ga: Caithfidh fostaíocht inárachais a bheith agat in Éirinn agus caithfidh gur íoc tú do ranníocaíocht ÁSPC is déanaí in Éirinn

source: More information is available in our document about combining your social insurance contributions from abroad
ga: Tá níos mó faisnéise ar fáil inár gcáipéis faoi Ranníocaíochtaí árachais shóisialaigh ón gcoigríoch a chomhcheangal

source: If you are self-employed you must be in insurable employment and have:
ga: Má tá tú féinfhostaithe, caithfidh fostaíocht inárachais a bheith agat agus:

source: • 52 weeks PRSI contributions paid at Class S in the relevant tax year
ga: • 52 seachtain de ranníocaíochtaí ÁSPC a bheith íoctha agat ar Aicme S sa bhliain ábhartha chánach

source: For example, if you are going on paternity leave in 2017, the relevant tax year is 2015
ga: Mar shampla, má bheidh tú ag dul ar saoire atharthachta in 2017, is é 2015 an bhliain ábhartha chánach

source: • 52 weeks PRSI contributions paid at Class S in the tax year immediately before the relevant tax year
ga: • 52 seachtain de ranníocaíochtaí ÁSPC a bheith íoctha ar Aicme S sa bhliain ábhartha chánach díreach roimh an mbliain chánach ábhartha

source: For example, if you are going on paternity leave in 2017, the tax year immediately before the relevant tax year is 2014
ga: Mar shampla, má bheidh tú ag dul ar saoire atharthachta in 2017, is é 2014 an bhliain ábhartha chánach díreach roimh an mbliain ábhartha chánach

source: • 52 weeks PRSI contributions paid at Class S in the tax year immediately following the relevant tax year
ga: • 52 seachtain de ranníocaíochtaí ÁSPC a bheith íoctha agat ar Aicme S sa bhliain chánach díreach i ndiaidh na bliana ábhartha cánach

source: For example, if you are going on paternity leave in 2017, the tax year immediately following the relevant tax year is 2016
ga: Mar shampla, má bheidh tú ag dul ar saoire atharthachta in 2017, is é 2016 an bhliain chánach díreach i ndiaidh na bliana ábhartha cánach

source: If you do not meet these PRSI conditions and you were in insurable employment before becoming self-employed, you can use your PRSI contributions (Class A, E and H) in that employment to qualify for Paternity Benefit – see PRSI conditions for employed people above
ga: Mura gcomhlíonann tú na coinníollacha ÁSPC seo agus má bhí tú i bhfostaíocht inárachais sular thosaigh tús leis an bhféinfhostaíocht, féadfaidh tú do ranníocaíochtaí ÁSPC (Aicme A, E agus H) a úsáid san fhostaíocht sin chun cáiliú do Shochar Atharthachta – féach ranníocaíochtaí ÁSPC do dhaoine fostaithe thuas

source: If you are in insurable self-employment, you are not awarded credited contributions or credits automatically when you are getting Paternity Benefit
ga: Má tá tú i bhféinfhostaíocht inárachais, ní bhronntar ort ranníocaíochtaí creidiúnaithe ná creidmheasanna go huathoibríoch nuair a bhíonn Sochar Atharthachta á fháil agat

source: A self-employed person is not specifically excluded from employment credits
ga: Ní dhéantar duine féinfhostaithe a eisiamh go sonrach ó chreidmheasanna fostaíochta

source: You may qualify for credits if you meet the conditions
ga: Féadfaidh tú cáiliú do chreidmheasanna má chomhlíonann tú na coinníollacha

source: For example, an applicant for Paternity Benefit who is now self-employed but had been employed in 2015 would qualify for credits
ga: Mar shampla, cháileodh iarratasóir ar Shochar Atharthachta atá féinfhostaithe anois ach a bhí fostaithe in 2015 do chreidmheasanna

source: If they have been only self-employed, without being employed, for the last 3 years they won’t qualify for credits
ga: Mura mbeidís ach féinfhostaithe, gan a bheith fostaithe, le 3 bliana anuas, ní cháileoidís do chreidmheasanna

source: If you are already getting a social welfare payment
ga: Má tá íocaíocht leasa shóisialaigh á fáil agat cheana féin

source: Half-rate Paternity Benefit may be payable if you are getting any one of the following payments:
ga: D’fhéadfadh go mbeadh Sochar Atharthachta ar leathráta iníoctha má bhí aon cheann de na híocaíochtaí a leanas á fháil agat:

source: • Widower's and Surviving Civil Partner's (Contributory) Pension
ga: • Pinsean Baintrí/Baintreach Fir agus Páirtnéara Shibhialta Mharthanaigh (Ranníocaíoch)

source: • Widower's and Surviving Civil Partner's (Non-Contributory) Pension
ga: • Pinsean Baintrí/Baintreach Fir agus Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach)

source: • Death Benefit by way of Widow's/Widower's/Surviving Civil Partner's or Dependent Parents' Pension (under the Occupational Injuries Scheme)
ga: • Sochar Báis trí Phinsean Baintrí/Baintreach Fir/Páirtnéara Shibhialta Mharthanaigh nó Pinsean Tuismitheora Chleithiúnaigh (faoin Scéim Díobhálacha Ceirde)

source: If you are providing full-time care to another person, you may qualify for half-rate Carer's Allowance with your Paternity Benefit
ga: Má tá cúram lánaimseartha á sholáthar agat do dhuine eile, b’fhéidir go gcáileoidh tú do Liúntas Cúramóra ar leathráta in éineacht le do Shochar Atharthachta

source: All employees must have their paternity leave certified by their employer
ga: Caithfidh a bhfostóir a saoire atharthachta a dheimhniú do gach fostaí

source: If you are self-employed you self-certify your leave
ga: Má tá tú féinfhostaithe, déanann tú féin do shaoire a fhéindeimhniú

source: If you're an employee, you must provide your employer with proof of the expected date of confinement of your spouse or partner
ga: Caithfidh tú cruthúnas a sholáthar i dtaobh an dáta a bhfuil súil leis go mbéarfaidh do chéile nó do pháirtnéir ar an leanbh

source: In other words, you will be required to provide your employer with a certificate from your spouse or partner's doctor confirming when your baby is due, or confirmation of the baby’s actual date of birth if you apply for leave after the birth has occurred
ga: I bhfriotal eile, beidh ort deimhniú a sholáthar ó dhochtúir do chéile nó do pháirtnéara shibhialta ina ndeimhnítear cathain a bhfuil súil leis go saolófar do leanbh, nó deimhniú maidir leis an dáta féin breithe má tá iarratas á dhéanamh agat i ndiaidh na breithe

source: In the case of adoption, you must produce a certificate of placement in relation to the child
ga: I gcás uchtála, caithfidh tú deimhniú socrúcháin maidir leis an leanbh a sholáthar

source: In the case of an intercountry adoption that took place outside the State,you must produce a declaration of eligibility and suitability in relation to the child and particulars in writing of the day of placement or expected day of placement
ga: I gcás uchtáil idirthíre a thit amach lasmuigh den Stát, caithfidh tú dearbhú incháilitheachta agus oiriúnachta maidir leis an leanbh agus critéir i scríbhinn a sholáthar a bhaineann le lá an tsocrúcháin nó leis an lá a bhfuil súil leis go ndéanfar an socrúchán

source: If, at any stage you decide not to take your paternity leave, you cannot be paid Paternity Benefit
ga: Má chinneann tú, ag céim ar bith, gan glacadh le do shaoire atharthachta, ní féidir Sochar Atharthachta a íoc leat

source: You should inform the Paternity Benefit section of the Department of Social Protection of any changes to your paternity leave arrangements
ga: Ba cheart duit rannóg Sochar Atharthachta na Roinne Coimirce Sóisialaí a chur ar an eolas ar aon athruithe a thagann ar do shocruithe maidir le saoire atharthachta

source: Duration of Paternity Benefit
ga: Fad an tSochair Atharthachta

source: Paternity Benefit is paid for 2 weeks and the 2 weeks must be taken consecutively
ga: Íoctar Sochar Atharthachta ar feadh 2 sheachtain agus ní mór an 2 sheachtain a ghlacadh i ndiaidh a chéile

source: From 13 March 2017: Paternity Benefit is €235 per week
ga: Is ionann Sochar Atharthachta agus €235 sa tseachtain

source: If you have dependants your rate of Paternity Benefit (excluding increases for dependants) is compared to the rate of Illness Benefit (including increases for dependants) that would be paid to you if you were absent from work through illness
ga: Má tá cleithiúnaithe agat, cuirtear do ráta Sochar Atharthachta (gan méaduithe do chleithiúnaithe a chur san áireamh) i gcomparáid leis an ráta Sochar Breoiteachta (méaduithe do chleithiúnaithe san áireamh) a d’íocfaí leat dá mbeifeá as láthair ón obair de bharr tinnis

source: The higher of the 2 rates is paid to you
ga: Íoctar an ráta is airde den 2 ráta leat

source: Although the Illness Benefit rate begins from a lower personal base amount (€193 is the maximum Illness Benefit personal rate), it also takes into account extra payments for your family
ga: Cé go gcuirtear tús leis an ráta Sochar Breoiteachta ó bhunmhéid pearsanta níos ísle (is é €193 an ráta uasta pearsanta de Shochar Breoiteachta), cuireann sé san áireamh íocaíochtaí breise do do theaghlach

source: This is why, depending on the circumstances of your spouse, civil partner or cohabitant and how many children you have, the rate paid to you may be greater than the rate you would otherwise be entitled to
ga: Seo an fáth, ag brath ar chúinsí do chéile, páirtnéara shibhialta nó do chomháitritheora agus ar cé mhéid leanaí atá agat, go bhféadfadh a ráta a íoctar leat a bheith níos airde ná an ráta a mbeifeá i dteideal a fháil murach sin

source: Example (March 2017 rates): John is entitled to the standard Paternity Benefit rate of €235
ga: Sampla (rátaí ó Márta 2017): Tá Seán i dteideal an ráta caighdeánach de Shochar Atharthachta €235 a fháil

source: His partner is unemployed and signing on for unemployment credits
ga: Tá a pháirtnéir dífhostaithe agus tá síniú á dhéanamh aici le haghaidh creidmheasanna dífhostaíochta

source: They have 2 children
ga: Tá beirt leanaí acu

source: If he got Illness Benefit he would get €380.70 (this is the personal rate of Illness Benefit + an Increase for a Qualified Adult + Increases for 2 Qualified Children)
ga: Dá bhfaigheadh sé Sochar Breoiteachta, gheobhadh sé €380.70 (is ionann seo agus an ráta pearsanta de Shochar Breoiteachta + Méadú do Dhuine Fásta Cáilithe + Méaduithe do Bheirt Leanaí Cáilithe)

source: He cannot get less Paternity Benefit than he would get if ill and getting Illness Benefit
ga: Ní féidir leis Sochar Atharthachta níos lú a fháil ná mar a gheobhadh sé dá mbeadh sé tinn agus dá mbeadh Sochar Breoiteachta á fháil aige

source: For this reason, he will get Paternity Benefit of €380.70
ga: Ar an gcúis seo, gheobhaidh sé Sochar Atharthachta €380.70

source: If your adult dependant is getting a social welfare payment you will not get an Increase for a Qualified Adult (IQA) but you may get a half-rate Increase for a Qualified Child (IQC)
ga: Má tá íocaíocht leasa shóisialaigh á fáil ag do chleithiúnaí fásta, ní bhfaighidh tú Méadú do Dhuine Fásta Cáilithe (MDFC) ach b’fhéidir go bhfaighidh tú Méadú do Leanbh Cáilithe (MDC) ar leathráta

source: You will qualify for a full-rate IQA and a full-rate IQC, if your adult dependant is unemployed and signing on for credits or is earning under €100.01 per week
ga: Íoctar Sochar Atharthachta díreach isteach i do chuntas bainc nó comhar creidmheasa (cuntas reatha nó taisce, seachas cuntas morgáiste) nó féadfaidh tú a roghnú go n-íoctar é go díreach isteach i gcuntas bainc d’fhostóra

source: If your adult dependant is earning between €100.01 and €310 per week you will get a tapered rate of IQA and a full-rate IQC
ga: Nóta: Leanfaidh roinnt fostóirí le fostaí a íoc, ina iomláine, fad a bhíonn an fostaí ar saoire atharthachta

source: If your adult dependant is earning between €310.01 and €400 per week you will not get an IQA but you will get half rate IQC
ga: Sna cásanna siúd, is gnách go n-iarrfaidh an fostóir ar an bhfostaí go n-íoctar leo aon Sochar Atharthachta a fhaigheann siad

source: If your adult dependant earns over €400 per week you will not get an IQA or IQC
ga: Ba cheart duit do chonradh fostaíochta a sheiceáil féachaint cad a bhaineann leat

source: EU and non-EU citizens can holiday abroad and get Paternity Benefit for a maximum of 2 weeks while away
ga: Gearrtar cáin ar Shochar Atharthachta i measc gach éilitheora

source: To get Paternity Benefit while abroad, you need to inform Paternity Benefit Section of your intended absence either by email at: paternityben@welfare.ie or by calling 01 471 58 98 or Lo-call: 1890 690 690
ga: Níl Muirear Sóisialta Uilíoch agus ÁSPC le híoc. Féadfaidh tú léamh faoi conas a ghearrtar cáin ar Shochar Atharthachta sa cháipéis, Gearradh cánach ar íocaíochtaí leasa shóisialaigh

source: How the payment is made
ga: Conas iarratas a dhéanamh

source: Paternity Benefit is paid directly into your bank or building society account (a current or deposit account, not a mortgage account) or you can choose to have it paid directly into your employer's bank account
ga: Caithfidh tú fógra a thabhairt do d’fhostóir ceithre seachtaine, ar a laghad, sula nglacann tú do shaoire atharthachta (12 sheachtain má tá tú féinfhostaithe). Má tá leanbh á uchtú agat, caithfidh tú deimhniú a sholáthar maidir le dáta socrúcháin do linbh

source: Note: Some employers will continue to pay an employee, in full, while the employee is on paternity leave
ga: Má tá tú fostaithe, caithfidh tú cruthúnas a sholáthar do d’fhostóir maidir leis an dáta a bhfuil súil leis go dtabharfaidh do chéile nó páirtnéir an leanbh ar an saol

source: In such cases the employer will generally require the employee to have any Paternity Benefit paid to them. You should check your contract of employment to see what applies to you
ga: I bhfriotal eile, beidh ort deimhniú a sholáthar ó dhochtúir do chéile nó do pháirtnéara shibhialta ina ndeimhnítear cathain a bhfuil súil leis go saolófar do leanbh, nó deimhniú maidir leis an dáta féin breithe má tá iarratas á dhéanamh agat i ndiaidh na breithe

source: Paternity Benefit is taxable for all claimants
ga: Fostaithe: Caithfidh d’fhostóir foirm a chomhlánú lena dheimhniú go bhfuil tú i dteideal saoire atharthachta

source: Universal Social Charge and PRSI are not payable
ga: Foirm PB2: Deimhniú Fostóra do Shochar Atharthachta (pdf) an fhoirm seo

source: You can read about how Paternity Benefit is taxed in the document, Taxation of social welfare payments
ga: Ansin, beidh ort Foirm Iarratais ar Shochar Atharthachta (pdf) a chomhlánú

source: How to apply
ga: Daoine féinfhostaithe: Má tá tú féinfhostaithe, caithfidh dochtúir an dáta a bhfuil súil leis go saolófar do leanbh (nó dáta féin breithe an linbh) a dheimhniú

source: You should apply for Paternity Benefit 4 weeks before you intend to go on paternity leave (12 weeks if you are self-employed)
ga: Teastaíonn seo lena dheimhniú go bhfuil tú i dteideal saoire atharthachta a ghlacadh

source: Employees: Your employer must certify that you are entitled to paternity leave using form PB2: Employer Certificate for Paternity Benefit (pdf)
ga: Foirm PB3: Deimhniú Leighis do Shochar Atharthachta (pdf) atá i gceist leis an bhfoirm seo

source: You will also need to complete the Paternity Benefit Application form (pdf)
ga: Ansin, beidh ort Foirm Iarratais ar Shochar Atharthachta (pdf) a chomhlánú, chomh maith

source: This is form PB3: Medical Certificate for Paternity Benefit (pdf)
ga: Cá háit a ndéanfaidh mé iarratas

source: You can apply for Paternity Benefit online at mywelfare.ie
ga: Beidh tú in ann iarratas a dhéanamh ar Shochar Atharthachta ar líne ag mywelfare.ie
